aws/amazon-freertos/vendors/nordic/boards/nrf52840-dk/ports/common_io/iot_spi.c
/*
 * FreeRTOS Common IO V0.1.1
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/**
 * @file iot_spi.c
 * @brief HAL spi implementation on NRF52840 Development Kit 
 */

/* Nordic Board includes. */
#include "nrf_drv_spi.h"
#include "nrf_gpio.h"

/* Main includes. */
#include "iot_spi.h"

#define IOT_SPI_BLOCKING_TIMEOUT    ( ( uint32_t ) 3000UL ) /* In milliseconds */
#define IOT_SPI_CLOSED              ( ( uint8_t ) 0 )
#define IOT_SPI_OPENED              ( ( uint8_t ) 1 )

typedef struct SpiContext {
    nrf_drv_spi_t        instance;
    nrf_drv_spi_config_t config;
} SpiContext_t;

typedef struct IotSPIDescriptor
{
    SpiContext_t const * pxSpiContext;          /* Nordic Handle */
    IotSPIMasterConfig_t xConfig;                /* Master Configuration */
    IotSPICallback_t xSpiCallback;               /* Callback function */
    void * pvUserContext;                        /* User context passed in callback */
    uint8_t sOpened;                             /* Bit flags to track different states. */
} IotSPIDescriptor_t;
/*-----------------------------------------------------------*/

#define RADIO_RESET                                 NRF_GPIO_PIN_MAP(0, 3)  // Out: Active LOW shield reset
#define RADIO_MOSI                                  NRF_GPIO_PIN_MAP(1, 13) // Out: SPI Slave input
#define RADIO_MISO                                  NRF_GPIO_PIN_MAP(1, 14) // In : SPI Slave output
#define RADIO_SCLK                                  NRF_GPIO_PIN_MAP(1, 15) // Out: SPI Slave clock
#define RADIO_NSS                                   NRF_GPIO_PIN_MAP(1, 8)  // Out: SPI Slave select
#define RADIO_BUSY                                  NRF_GPIO_PIN_MAP(1, 4)  // In :
#define RADIO_DIO_1                                 NRF_GPIO_PIN_MAP(1, 6)  // In : Setup to be the IRQ line. Needs GPIOTE

static SpiContext_t xSpiContexts[] =
{
    {
        .instance = NRF_DRV_SPI_INSTANCE(0),
        .config   = {
            .sck_pin      = NRF_GPIO_PIN_MAP(1, 15),                
            .mosi_pin     = NRF_GPIO_PIN_MAP(1, 13),                
            .miso_pin     = NRF_GPIO_PIN_MAP(1, 14),                
            .ss_pin       = NRF_DRV_SPI_PIN_NOT_USED,                
            .irq_priority = SPI_DEFAULT_CONFIG_IRQ_PRIORITY,         
            .orc          = 0xFF,                                    
            .frequency    = NRF_DRV_SPI_FREQ_4M,                     
            .mode         = NRF_DRV_SPI_MODE_0,                      
            .bit_order    = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST,         
        }
    },
    {
        .instance = NRF_DRV_SPI_INSTANCE(1),
        .config   = {
            .sck_pin      = NRF_DRV_SPI_PIN_NOT_USED,                
            .mosi_pin     = NRF_DRV_SPI_PIN_NOT_USED,                
            .miso_pin     = NRF_DRV_SPI_PIN_NOT_USED,                
            .ss_pin       = NRF_DRV_SPI_PIN_NOT_USED,                
            .irq_priority = SPI_DEFAULT_CONFIG_IRQ_PRIORITY,         
            .orc          = 0xFF,                                    
            .frequency    = NRF_DRV_SPI_FREQ_4M,                     
            .mode         = NRF_DRV_SPI_MODE_0,                      
            .bit_order    = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST,         
        }
    },
    {
        .instance = NRF_DRV_SPI_INSTANCE(2),
        .config   = {
            .sck_pin      = NRF_DRV_SPI_PIN_NOT_USED,                
            .mosi_pin     = NRF_DRV_SPI_PIN_NOT_USED,                
            .miso_pin     = NRF_DRV_SPI_PIN_NOT_USED,                
            .ss_pin       = NRF_DRV_SPI_PIN_NOT_USED,                
            .irq_priority = SPI_DEFAULT_CONFIG_IRQ_PRIORITY,         
            .orc          = 0xFF,                                    
            .frequency    = NRF_DRV_SPI_FREQ_4M,                     
            .mode         = NRF_DRV_SPI_MODE_0,                      
            .bit_order    = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST,         
        }
    }
};

/*
 * Forward declare event handler passed to NRF SPI controller. 
 * Invokes user callbacks for async modes. 
 * Sync modes poll atomic flags to track state
 */
static volatile bool bTransferDone = true;
static void prvSpiEventHandler(nrf_drv_spi_evt_t const * pxEvent, void * pvContext);
static int32_t prvSpiTransfer(nrf_drv_spi_t const * const pxInstance, 
                              uint8_t const * pucTxBuffer,
                              size_t  xTxSize,
                              uint8_t const * pucRxBuffer,
                              size_t xRxSize,
                              bool   bSync);

/*-----------------------------------------------------------*/

static IotSPIDescriptor_t xSpi1 =
{
    .pxSpiContext  = &xSpiContexts[ 0 ],
    .xConfig       = { 0 },
    .xSpiCallback  = NULL,
    .pvUserContext = NULL,
    .sOpened       = IOT_SPI_CLOSED,
};

