aws/amazon-freertos/vendors/nordic/boards/nrf52840-dk/ports/common_io/iot_spi.c
static IotSPIDescriptor_t xSpi2 =
{
    .pxSpiContext  = &xSpiContexts[ 1 ],
    .xConfig       = { 0 },
    .xSpiCallback  = NULL,
    .pvUserContext = NULL,
    .sOpened       = IOT_SPI_CLOSED,
};

static IotSPIDescriptor_t xSpi3 =
{
    .pxSpiContext  = &xSpiContexts[ 2 ],
    .xConfig       = { 0 },
    .xSpiCallback  = NULL,
    .pvUserContext = NULL,
    .sOpened       = IOT_SPI_CLOSED,
};
/*-----------------------------------------------------------*/

static IotSPIHandle_t const pxSpis[] = { &xSpi1, &xSpi2, &xSpi3 };

/*--------------------API Implementation---------------------*/

IotSPIHandle_t iot_spi_open( int32_t lSpiInstance )
{
    IotSPIHandle_t xHandle = NULL;

    if( ( lSpiInstance >= 0 ) && ( lSpiInstance < sizeof( pxSpis ) / sizeof( IotSPIHandle_t ) ) )
    {
        xHandle = pxSpis[ lSpiInstance ];

        if( xHandle->sOpened == IOT_SPI_CLOSED )
        {
            /* Leave the handler and handler context as NULL to initialize driver as blocking */
            const SpiContext_t * pxSpi = xHandle->pxSpiContext;
            if (NRF_SUCCESS != nrf_drv_spi_init(&pxSpi->instance, &pxSpi->config, prvSpiEventHandler, ( void * ) xHandle))
            {
                xHandle = NULL;
            }
            else
            {
                xHandle->sOpened = IOT_SPI_OPENED;
            }
        }
        else
        {
            xHandle = NULL;
        }
    }

    return xHandle;
}
/*-----------------------------------------------------------*/

void iot_spi_set_callback( IotSPIHandle_t const pxSPIPeripheral,
                           IotSPICallback_t xCallback,
                           void * pvUserContext )
{
    if( ( pxSPIPeripheral != NULL ) )
    {
        pxSPIPeripheral->xSpiCallback = xCallback;
        pxSPIPeripheral->pvUserContext = pvUserContext;
    }
}
/*-----------------------------------------------------------*/

int32_t iot_spi_ioctl( IotSPIHandle_t const pxSPIPeripheral,
                       IotSPIIoctlRequest_t xSPIRequest,
                       void * const pvBuffer )
{
    int32_t lError = IOT_SPI_INVALID_VALUE;

    if( ( pxSPIPeripheral != NULL ) && ( pvBuffer != NULL ) )
    {
        SpiContext_t * pxSpi = pxSPIPeripheral->pxSpiContext;

        switch( xSPIRequest )
        {
            case eSPISetMasterConfig:

                if( !bTransferDone )
                {
                    lError = IOT_SPI_BUS_BUSY;
                }
                else
                {
                    IotSPIMasterConfig_t * pxUserConfig = ( IotSPIMasterConfig_t * ) pvBuffer;

                    /* Ensure valid user config inputs */
                    if (pxUserConfig->ulFreqPrescaler != NRF_SPI_FREQ_125K ||
                        pxUserConfig->ulFreqPrescaler != NRF_SPI_FREQ_250K ||
                        pxUserConfig->ulFreqPrescaler != NRF_SPI_FREQ_500K ||
                        pxUserConfig->ulFreqPrescaler != NRF_SPI_FREQ_1M ||
                        pxUserConfig->ulFreqPrescaler != NRF_SPI_FREQ_2M ||
                        pxUserConfig->ulFreqPrescaler != NRF_SPI_FREQ_4M ||
                        pxUserConfig->ulFreqPrescaler != NRF_SPI_FREQ_8M)
                        {
                            return;
                        }


                    /* Prepare configuration per user request */
                    pxSpi->config.mode = (nrf_drv_spi_mode_t) pxUserConfig->eMode;
                    pxSpi->config.bit_order = pxUserConfig->eSetBitOrder == eSPIMSBFirst ? NRF_DRV_SPI_BIT_ORDER_MSB_FIRST : NRF_DRV_SPI_BIT_ORDER_LSB_FIRST;
                    pxSpi->config.frequency = pxUserConfig->ulFreqPrescaler;

                    /* Re-initialize the instance with updated config */
                    nrf_drv_spi_uninit(&pxSpi->instance);
                    if ( NRF_SUCCESS == nrf_drv_spi_init(&pxSpi->instance, 
                                                         &pxSpi->config, 
                                                         pxSPIPeripheral->xSpiCallback, 
                                                         ( void * )pxSPIPeripheral->pvUserContext))
                    {
                        lError = IOT_SPI_SUCCESS;
                    }

                    pxSPIPeripheral->xConfig = *( IotSPIMasterConfig_t * ) pvBuffer;
                }

                break;

            case eSPIGetMasterConfig:

                ( ( IotSPIMasterConfig_t * ) pvBuffer )->ulFreqPrescaler = pxSPIPeripheral->xConfig.ulFreqPrescaler;
                ( ( IotSPIMasterConfig_t * ) pvBuffer )->eMode           = pxSPIPeripheral->xConfig.eMode;
                ( ( IotSPIMasterConfig_t * ) pvBuffer )->eSetBitOrder    = pxSPIPeripheral->xConfig.eSetBitOrder;
                ( ( IotSPIMasterConfig_t * ) pvBuffer )->ucDummyValue    = pxSPIPeripheral->xConfig.ucDummyValue;

                lError = IOT_SPI_SUCCESS;

                break;

            /* pxSpi->instance can be used to get NRF_SPIM_Type which contains ->TX->PTR that shows address of byte to send.
               Poiner arithmetic could be reveal n_sent/n_readm, but would need to save base address of last requested rxtx buffer.
               There's also ->TX->AMOUNT and if it's a running counter, that may be a candidate as well. See datasheet for SPIM details. 
               Unimplemented for now.*/
            case eSPIGetTxNoOfbytes:
            case eSPIGetRxNoOfbytes:
            default:
                break;
        }
    }

    return lError;
}
/*-----------------------------------------------------------*/

int32_t iot_spi_read_sync( IotSPIHandle_t const pxSPIPeripheral,
                           uint8_t * const pvBuffer,
                           size_t xBytes )
{
    int32_t lError = IOT_SPI_SUCCESS;

    /* TODO: How to find a way to tell if slave is not selected */
    if( ( pxSPIPeripheral == NULL ) || ( pxSPIPeripheral->sOpened == IOT_SPI_CLOSED ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else if( ( pvBuffer == NULL ) || ( xBytes == 0 ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else
    {
        const SpiContext_t * pxSpi = pxSPIPeripheral->pxSpiContext;

        lError = prvSpiTransfer(&pxSpi->instance, NULL, 0, pvBuffer, xBytes, true);
    }

    return lError;
}
/*-----------------------------------------------------------*/

int32_t iot_spi_read_async( IotSPIHandle_t const pxSPIPeripheral,
                            uint8_t * const pvBuffer,
                            size_t xBytes )
{
    int32_t lError = IOT_SPI_SUCCESS;

    /* TODO: Add case for slave not selected? */
    if( ( pxSPIPeripheral == NULL ) || ( pxSPIPeripheral->sOpened == IOT_SPI_CLOSED ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else if( ( pvBuffer == NULL ) || ( xBytes == 0 ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else
    {
        const SpiContext_t * pxSpi = pxSPIPeripheral->pxSpiContext;

        lError = prvSpiTransfer(&pxSpi->instance, NULL, 0, pvBuffer, xBytes, false);
    }

    return lError;
}
/*-----------------------------------------------------------*/

