aws/amazon-freertos/vendors/nordic/boards/nrf52840-dk/ports/common_io/iot_spi.c
int32_t iot_spi_write_sync( IotSPIHandle_t const pxSPIPeripheral,
                            uint8_t * const pvBuffer,
                            size_t xBytes )
{
    int32_t lError = IOT_SPI_SUCCESS;

    /* TODO: Add case for slave not selected? */
    if( ( pxSPIPeripheral == NULL ) || ( pxSPIPeripheral->sOpened == IOT_SPI_CLOSED ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else if( ( pvBuffer == NULL ) || ( xBytes == 0 ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else
    {
        const SpiContext_t * pxSpi = pxSPIPeripheral->pxSpiContext;

        lError = prvSpiTransfer(&pxSpi->instance, pvBuffer, xBytes, NULL, 0, true);
    }

    return lError;
}
/*-----------------------------------------------------------*/

int32_t iot_spi_write_async( IotSPIHandle_t const pxSPIPeripheral,
                             uint8_t * const pvBuffer,
                             size_t xBytes )
{
    int32_t lError = IOT_SPI_SUCCESS;

    /* TODO: Add case for slave not selected? */
    if( ( pxSPIPeripheral == NULL ) || ( pxSPIPeripheral->sOpened == IOT_SPI_CLOSED ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else if( ( pvBuffer == NULL ) || ( xBytes == 0 ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else
    {
        const SpiContext_t * pxSpi = pxSPIPeripheral->pxSpiContext;

        lError = prvSpiTransfer(&pxSpi->instance, pvBuffer, xBytes, NULL, 0, false);
    }

    return lError;
}
/*-----------------------------------------------------------*/

int32_t iot_spi_transfer_sync( IotSPIHandle_t const pxSPIPeripheral,
                               uint8_t * const pvTxBuffer,
                               uint8_t * const pvRxBuffer,
                               size_t xBytes )
{
    int32_t lError = IOT_SPI_SUCCESS;

    /* TODO: Add case for slave not selected? */
    if( ( pxSPIPeripheral == NULL ) || ( pxSPIPeripheral->sOpened == IOT_SPI_CLOSED ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else if( ( pvTxBuffer == NULL ) || ( pvRxBuffer == NULL ) || ( xBytes == 0 ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else
    {
        const SpiContext_t * pxSpi = pxSPIPeripheral->pxSpiContext;

        lError = prvSpiTransfer(&pxSpi->instance, pvTxBuffer, xBytes, pvRxBuffer, xBytes, true);
    }

    return lError;
}
/*-----------------------------------------------------------*/

int32_t iot_spi_transfer_async( IotSPIHandle_t const pxSPIPeripheral,
                                uint8_t * const pvTxBuffer,
                                uint8_t * const pvRxBuffer,
                                size_t xBytes )
{
    int32_t lError = IOT_SPI_SUCCESS;

    /* TODO: Add case for slave not selected? */
    if( ( pxSPIPeripheral == NULL ) || ( pxSPIPeripheral->sOpened == IOT_SPI_CLOSED ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else if( ( pvTxBuffer == NULL ) || ( pvRxBuffer == NULL ) || ( xBytes == 0 ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else
    {
        const SpiContext_t * pxSpi = pxSPIPeripheral->pxSpiContext;
        
        lError = prvSpiTransfer(&pxSpi->instance, pvTxBuffer, xBytes, pvRxBuffer, xBytes, false);
    }

    return lError;
}
/*-----------------------------------------------------------*/

int32_t iot_spi_close( IotSPIHandle_t const pxSPIPeripheral )
{
    int32_t lError = IOT_SPI_SUCCESS;

    if( ( pxSPIPeripheral == NULL ) || ( pxSPIPeripheral->sOpened == IOT_SPI_CLOSED ) )
    {
        lError = IOT_SPI_INVALID_VALUE;
    }
    else
    {
        const SpiContext_t * pxSpi = pxSPIPeripheral->pxSpiContext;
        int32_t lCancelStatus = iot_spi_cancel(pxSPIPeripheral);

        if (lCancelStatus == IOT_SPI_NOTHING_TO_CANCEL || lCancelStatus == IOT_SPI_SUCCESS) 
        {
            nrf_drv_spi_uninit(&pxSpi->instance);
            pxSPIPeripheral->sOpened = IOT_SPI_CLOSED;
        } 
        else
        {
            lError = lCancelStatus;
        }
    }

    return lError;
}
/*-----------------------------------------------------------*/

int32_t iot_spi_cancel( IotSPIHandle_t const pxSPIPeripheral )
{
    int32_t lError = IOT_SPI_INVALID_VALUE;

    if( ( pxSPIPeripheral != NULL ) && ( pxSPIPeripheral->sOpened == IOT_SPI_OPENED ) )
    {
        const SpiContext_t * pxSpi = pxSPIPeripheral->pxSpiContext;

        if (!bTransferDone)
        {
            nrf_drv_spi_abort( &pxSpi->instance );
            lError = IOT_SPI_SUCCESS;
        }
        else 
        {
            lError = IOT_SPI_NOTHING_TO_CANCEL;
        }
    }

    return lError;
}
/*-----------------------------------------------------------*/

/*
 * Event handler passed to NRF SPI controller. Used for sync and async modes.
 * Note, pvContext is set to IotSPIHandle_t of corresponding SPI instance at open.
 */
void prvSpiEventHandler(nrf_drv_spi_evt_t const * pxEvent, void * pvContext)
{
    IotSPIHandle_t xHandle = ( IotSPIHandle_t ) pvContext;
    const SpiContext_t * pxSpi = xHandle->pxSpiContext;

    switch( pxEvent->type )
    {
        case NRF_DRV_SPI_EVENT_DONE:
            /* Adjust atomic flags. These are used by sync modes for polling and reproduces internal nRF_SDK blocking behaviour */
            CRITICAL_REGION_ENTER();
            bTransferDone = true;
            CRITICAL_REGION_EXIT();
            
            /* In case of async transfers, event handlers should have been set, and should now be invoked */
            if (xHandle->xSpiCallback != NULL)
            {
                xHandle->xSpiCallback( eSPISuccess, xHandle->pvUserContext );
            }
            break;

        default:
            break;
    }
}

/*
 * Transfer logic, with less parameter checking.
 * Maintains internal atomics and applies appropriate CommonIO error codes
 * Called by other CommonIO that check input parameters before calling.
*/
static int32_t prvSpiTransfer(nrf_drv_spi_t const * const pxInstance, 
                              uint8_t const * pucTxBuffer,
                              size_t  xTxSize,
                              uint8_t const * pucRxBuffer,
                              size_t xRxSize,
                              bool   bSync)
{
    int32_t lError = IOT_SPI_SUCCESS;

    if (bTransferDone)
    {
        /* There was no transfer in progress, so we can safely attempt a new transfer */
        CRITICAL_REGION_ENTER();
        bTransferDone = false;
        CRITICAL_REGION_EXIT();

