aws/amazon-freertos/vendors/nordic/boards/nrf52840-dk/ports/common_io/iot_spi.c
        ret_code_t xTransferStatus = nrf_drv_spi_transfer( pxInstance, pucTxBuffer, xTxSize, pucRxBuffer, xRxSize );
        
        if (NRF_SUCCESS != xTransferStatus) 
        {
            CRITICAL_REGION_ENTER();
            bTransferDone = true;
            CRITICAL_REGION_EXIT();

            lError = IOT_SPI_TRANSFER_ERROR;
        }
        else
        {
            if (bSync)
            {
                /* For sync transfers, we block until they complete */   
                while(bTransferDone);
            }
        }
    }
    else
    {
        lError = IOT_SPI_BUS_BUSY;
    }

    return lError;
}




#if 0 
void HAL_SPI_TxRxCpltCallback( SPI_HandleTypeDef * hspi )
{
    if( hspi->Instance == SPI1 )
    {
        xSpi1.xSpiCallback( eSPISuccess, xSpi1.pvUserContext );
    }
    else if( hspi->Instance == SPI2 )
    {
        xSpi2.xSpiCallback( eSPISuccess, xSpi2.pvUserContext );
    }
    else if( hspi->Instance == SPI3 )
    {
        xSpi3.xSpiCallback( eSPISuccess, xSpi3.pvUserContext );
    }
}
/*-----------------------------------------------------------*/

void HAL_SPI_TxCpltCallback( SPI_HandleTypeDef * hspi )
{
    if( hspi->Instance == SPI1 )
    {
        xSpi1.xSpiCallback( eSPISuccess, xSpi1.pvUserContext );
    }
    else if( hspi->Instance == SPI2 )
    {
        xSpi2.xSpiCallback( eSPISuccess, xSpi2.pvUserContext );
    }
    else if( hspi->Instance == SPI3 )
    {
        xSpi3.xSpiCallback( eSPISuccess, xSpi3.pvUserContext );
    }
}
/*-----------------------------------------------------------*/

void HAL_SPI_RxCpltCallback( SPI_HandleTypeDef * hspi )
{
    if( hspi->Instance == SPI1 )
    {
        xSpi1.xSpiCallback( eSPISuccess, xSpi1.pvUserContext );
    }
    else if( hspi->Instance == SPI2 )
    {
        xSpi2.xSpiCallback( eSPISuccess, xSpi2.pvUserContext );
    }
    else if( hspi->Instance == SPI3 )
    {
        xSpi3.xSpiCallback( eSPISuccess, xSpi3.pvUserContext );
    }
}
/*-----------------------------------------------------------*/

void HAL_SPI_ErrorCallback( SPI_HandleTypeDef * hspi )
{
    if( hspi->Instance == SPI1 )
    {
        xSpi1.xSpiCallback( eSPITransferError, xSpi1.pvUserContext );
    }
    else if( hspi->Instance == SPI2 )
    {
        xSpi2.xSpiCallback( eSPITransferError, xSpi2.pvUserContext );
    }
    else if( hspi->Instance == SPI3 )
    {
        xSpi3.xSpiCallback( eSPITransferError, xSpi3.pvUserContext );
    }
}
/*-----------------------------------------------------------*/

void SPI1_IRQHandler( void )
{
    HAL_SPI_IRQHandler( xSpi1.pxSpiContext->pxSpi );
}
/*-----------------------------------------------------------*/

void SPI2_IRQHandler( void )
{
    HAL_SPI_IRQHandler( xSpi2.pxSpiContext->pxSpi );
}
/*-----------------------------------------------------------*/

void SPI3_IRQHandler( void )
{
    HAL_SPI_IRQHandler( xSpi3.pxSpiContext->pxSpi );
}
/*-----------------------------------------------------------*/
ess, xSpi1.pvUserContext );
    }
    else if( hspi->Instance == SPI2 )
    {
        xSpi2.xSpiCallback( eSPISuccess, xSpi2.pvUserContext );
    }
    else if( hspi->Instance == SPI3 )
    {
        xSpi3.xSpiCallback( eSPISuccess, xSpi3.pvUserContext );
    }
}
/*-----------------------------------------------------------*/

void HAL_SPI_TxCpltCallback( SPI_HandleTypeDef * hspi )
{
    if( hspi->Instance == SPI1 )
    {
        xSpi1.xSpiCallback( eSPISuccess, xSpi1.pvUserContext );
    }
    else if( hspi->Instance == SPI2 )
    {
        xSpi2.xSpiCallback( eSPISuccess, xSpi2.pvUserContext );
    }
    else if( hspi->Instance == SPI3 )
    {
        xSpi3.xSpiCallback( eSPISuccess, xSpi3.pvUserContext );
    }
}
/*-----------------------------------------------------------*/

void HAL_SPI_RxCpltCallback( SPI_HandleTypeDef * hspi )
{
    if( hspi->Instance == SPI1 )
    {
        xSpi1.xSpiCallback( eSPISuccess, xSpi1.pvUserContext );
    }
    else if( hspi->Instance == SPI2 )
    {
        xSpi2.xSpiCallback( eSPISuccess, xSpi2.pvUserContext );
    }
    else if( hspi->Instance == SPI3 )
    {
        xSpi3.xSpiCallback( eSPISuccess, xSpi3.pvUserContext );
    }
}
/*-----------------------------------------------------------*/

void HAL_SPI_ErrorCallback( SPI_HandleTypeDef * hspi )
{
    if( hspi->Instance == SPI1 )
    {
        xSpi1.xSpiCallback( eSPITransferError, xSpi1.pvUserContext );
    }
    else if( hspi->Instance == SPI2 )
    {
        xSpi2.xSpiCallback( eSPITransferError, xSpi2.pvUserContext );
    }
    else if( hspi->Instance == SPI3 )
    {
        xSpi3.xSpiCallback( eSPITransferError, xSpi3.pvUserContext );
    }
}
/*-----------------------------------------------------------*/

void SPI1_IRQHandler( void )
{
    HAL_SPI_IRQHandler( xSpi1.pxSpiContext->pxSpi );
}
/*-----------------------------------------------------------*/

void SPI2_IRQHandler( void )
{
    HAL_SPI_IRQHandler( xSpi2.pxSpiContext->pxSpi );
}
/*-----------------------------------------------------------*/

void SPI3_IRQHandler( void )
{
    HAL_SPI_IRQHandler( xSpi3.pxSpiContext->pxSpi );
}
/*-----------------------------------------------------------*/
dler( xSpi3.pxSpiContext->pxSpi );
}
/*-----------------------------------------------------------*/
L_SPI_IRQHandler( xSpi3.pxSpiContext->pxSpi );
}
/*-----------------------------------------------------------*/
#endif